[
    {
      "type": "Analog",
      "nameProduct": "NP2576WM01 Analog Watch",
      "pictureLinks": [
        "https://rukminim1.flixcart.com/image/612/612/l13whow0/watch/h/c/c/-original-imagcqzchcngfd7a.jpeg?q=70"
      ],
      "description": "The NP2576WM01 Analog Watch is a beautifully designed timepiece for women. This is a genuine Titan product. The product comes with a standard brand warranty of 2 Years.",
      "color": [
        "White",
        "Gold"
      ],
      "size": [
        "39mm"
      ],
      "price": 93.99
    },
    {
      "type": "Analog",
      "nameProduct": "77085PP03 Volt Analog Watch",
      "pictureLinks": [
        "https://rukminim1.flixcart.com/image/612/612/l02r1jk0/watch/v/y/f/-original-imaf8qx8rmzayqrs.jpeg?q=70"
      ],
      "description": "An attractive honeycomb pattern in the matte black dial provides an empty artist's canvas for this sober and attractive watch from the Sonata Volt collection for men. A lovely medley of white and gold indices, artistically displayed only in the second half of the hour adds an aplomb to it. The watch's three distinctly subtle yet classy white and gold hands add a panache to it. The black plastic strap has a symbolic circuital pattern on it. This analog watch comes with a 12-month warranty.",
      "color": [
        "Black",
        "Red",
        "Blue"
      ],
      "size": [
        "45mm"
      ],
      "price": 49.99
    },
    {
      "type": "Analog",
      "nameProduct": "NQ1805NM02 Analog Watch",
      "pictureLinks": [
        "https://rukminim1.flixcart.com/image/612/612/kg2l47k0-0/watch/z/t/5/1805nm02-titan-original-imafwe7aupegsngp.jpeg?q=70"
      ],
      "description": "Enigmatic and alluring, this all black metallic watch is sure to make your peers go a little green! With its multifunction black linen dial, black steel case and oyster strap, this timepiece is the quintessential accessory for someone looking to command the room.",
      "color": [
        "Black",
        "Brown"
      ],
      "size": [
        "38mm"
      ],
      "price": 129.99
    },
    {
      "type": "Digital",
      "nameProduct": "NN38045PP03 Trendies Black Dial Silicone Strap Watch",
      "pictureLinks": [
        "https://rukminim1.flixcart.com/image/612/612/k4rcmfk0pkrrdj/watch-refurbished/7/c/g/c-38045pp03-fastrack-original-imaf8qx7vzuxrxr8.jpeg?q=70"
      ],
      "description": "Get ready to turn some heads with your swag and this stylish watch. This digital watch has numerous features like a chrono alarm, light button, day indicator and more! The orange detailing adds an edge to the watch's look and will surely give you an edge over others.",
      "color": [
        "Black",
        "Blue"
      ],
      "size": [
        "50mm"
      ],
      "price": 79.99
    },
    {
      "type": "Analog",
      "nameProduct": "Lacoste Club Analog Blue Dial Men's Watch-2011141",
      "pictureLinks": [
        "https://rukminim1.flixcart.com/image/612/612/ktbu6q80/watch/i/z/m/1-2011141-lacoste-men-original-imag6py9vm7z3pdr.jpeg?q=70"
      ],
      "description": "Classically elegant, the Lacoste Club is a sleek three-hand timepiece which combines an elevated finish with the brands signature relaxed appeal. Offered with a smooth leather strap or mesh bracelet in a choice of soft, feminine colorways, the watch has a striking pliss dial in reference to the Lacoste sporting heritage.",
      "color": [
        "White",
        "Blue"
      ],
      "size": [
        "35mm"
      ],
      "price": 199.99
    },
    {
      "type": "Smart Watch",
      "nameProduct": "Screen 4G Smart Watch S999 Android 9.0 4GB+64GB Heart Rate Monitor",
      "pictureLinks": [
        "https://i.ebayimg.com/images/g/U3gAAOSwDJFgd~i6/s-l500.jpg",
        "https://i.ebayimg.com/images/g/f7IAAOSwnt5gd~ZA/s-l500.jpg",
        "https://i.ebayimg.com/images/g/F1UAAOSwCFFgd~ZL/s-l500.jpg"
      ],
      "description": "This smart watch is simple and elegant, supports SIM card, 4G LTE network, WiFi, BT 5.0 wireless connection and 2.88-inch touch screen, a variety of sports functions, supports heart rate monitoring, suitable for men and women.",
      "color": [
        "Black"
      ],
      "size": [
        "37mm"
      ],
      "price": 227.99
    },
    {
      "type": "Digital",
      "nameProduct": "Garett Lady Elegance RT 5904238483763",
      "pictureLinks": [
        "https://watchard.com/media/catalog/product/cache/3/image/500x600/s/m/cache/1920_smartwatch-damski-garett-lady-elegance-rt-5904238483763.webp",
        "https://watchard.com/media/catalog/product/cache/3/zoomimage/x1600/s/m/smartwatch-damski-garett-lady-elegance-rt-5904238483763_5.webp",
        "https://watchard.com/media/catalog/product/cache/3/zoomimage/x1600/s/m/smartwatch-damski-garett-lady-elegance-rt-5904238483763-2.webp"
      ],
      "description": "Decorated in a fashionable rose gold color, Garett Lady Elegance RT 5904238483763 is a smartwatch for modern women. The manufacturer used stainless steel to make the round case and the mesh bracelet of the model, and the touch screen with backlight was covered with a hesalite glass. The device pairs with Android 4.4 and iOS 9.0 (+ newer) systems and connects to them using a Bluetooth 5.1 module. The functions that will support you in taking care of your health and systematic activity include: heart rate monitor, blood pressure monitor, pulse oximeter, sport modes, pedometer, inactivity monitor, hydration reminder, sleep monitor, motion sensor, route replay or stopwatch. Amenities useful on a daily basis include an application with the GPS option, vibration and sound notifications, notifications about SMS messages, calls and from the application, answering, rejecting and making calls, dialing keypad, music and camera control from the phone, device search function, discharge alarm, weather information, wake-up display, countdown timer and alarm clock. You can choose the Polish language version of the menu. The set includes an additional rubber strap. IP67 is protection against short immersion in water and dust. The smartwatch is covered by a 2-year warranty.",
      "color": [
        "Gold",
        "White"
      ],
      "size": [
        "36mm"
      ],
      "price": 169.99
    },
    {
      "type": "Analog",
      "nameProduct": "BQ2491 Bannon Multifunction Smoke Stainless Steel Watch - Fossil",
      "pictureLinks": [
        "https://rukminim1.flixcart.com/image/612/612/kyj0vbk0/watch/d/v/m/1-bq2491-fossil-men-original-imagaqzwnvpvjzyp.jpeg?q=70"
      ],
      "description": "This 45 mm Bannon watch features a sunray dial, multifunction movement and a metal bracelet. Making a big fat statement, the clean lines of the mid-century meet the modern looks of today, resulting in this timeless timepiece.",
      "color": [
        "Black",
        "Gray"
      ],
      "size": [
        "43mm"
      ],
      "price": 39.99
    },
    {
      "type": "Analog",
      "nameProduct": "Titan NH9710SM01E Raga Analog Watch",
      "pictureLinks": [
        "https://rukminim1.flixcart.com/image/612/612/k4rcmfk0pkrrdj/watch-refurbished/j/u/7/c-nh9710sm01e-titan-original-imafnnnmfhc8zrz6.jpeg?q=70"
      ],
      "description": "Make heads turn with this women's blue analog watch from Titan's Raga collection. This plain two handed watch features an asymmetrical shaped dial and has a quartz type movement. Made of premium quality metal, the strap of this watch is silver in colour. This watch is water resistant up to 30 meters. Wear it with your stylish outfits to look smart.",
      "color": [
        "Blue"
      ],
      "size": [
        "39mm"
      ],
      "price": 69.99
    },
    {
      "type": "Chronograph",
      "nameProduct": "Tudor Sport Chronograph 20300",
      "pictureLinks": [
        "https://i.ebayimg.com/images/g/OiAAAOSwsudkndKM/s-l1600.png",
        "https://i.ebayimg.com/images/g/OIMAAOSwHSxjEMRz/s-l640.jpg",
        "https://i.ebayimg.com/images/g/8N4AAOSwY~VkndKZ/s-l1600.png"
      ],
      "description": "The Tudor Sport Chronograph 20300 is a sophisticated men's steel watch with a classic black dial. It features an automatic movement, providing precise timekeeping without the need for a battery. The watch has a 41mm case size, making it suitable for various wrist sizes. Its chronograph function allows you to track elapsed time with precision. Crafted with high-quality materials, this watch combines style and durability for the modern gentleman.",
      "color": [
        "Black"
      ],
      "size": [
        "41mm"
      ],
      "price": 2999.99
    },
    {
      "type": "Analog",
      "nameProduct": "Brand In Box Mens Rockwell 747 Wrist Watch Black / White Sf-104",
      "pictureLinks": [
        "https://i.ebayimg.com/images/g/zzgAAOSwmOVh6xCY/s-l1600.png",
        "https://i.ebayimg.com/images/g/vbAAAOSwsvVh6xCf/s-l1600.png"
      ],
      "description": "",
      "color": [
        "Black",
        "Red",
        "Blue"
      ],
      "size": [
        "42mm"
      ],
      "price": 1299.99
    },
    {
      "type": "Analog",
      "nameProduct": "Zeno Watch Basel AS1130 hand winding Wrist Watch",
      "pictureLinks": [
        "https://i.ebayimg.com/images/g/wPIAAOSwuMdkvEwq/s-l1600.jpg",
        "https://i.ebayimg.com/images/g/HgEAAOSwszlkvEwq/s-l1600.jpg",
        "https://i.ebayimg.com/images/g/1WYAAOSwqOJkvEwq/s-l1600.jpg"
      ],
      "description": "Satin-finish Stainless Steel case with hardened mineral crystal and screw-on exposition back to view movement.",
      "color": [
        "Black",
        "White"
      ],
      "size": [
        "47mm"
      ],
      "price": 399.99
    },
    {
      "type": "Digital",
      "nameProduct": "Dual Time SKMEI Digital Watch SKMEI56",
      "pictureLinks": [
        "https://www.fastfashionbd.com/cdn/shop/products/4_2_0d2a1389-f756-4049-bad8-990e487438ca.jpg",
        "https://www.fastfashionbd.com/cdn/shop/products/5_79dc474a-1cf1-4181-9a4b-3003dbd64dd1.jpg",
        "https://www.fastfashionbd.com/cdn/shop/products/10_25231fd0-2643-4895-9d24-c80a1145b246.jpg"
      ],
      "description": "The SKMEI Dual Time Digital Watch #SKMEI56 is a stylish and versatile digital watch that is perfect for people who travel frequently or who need to keep track of time in two different time zones. The watch features two LCD displays, one for the local time and one for the time in another time zone. It also has a number of other features, including a day/date display, a world time function, an alarm, and a stopwatch.",
      "color": [
        "Black"
      ],
      "size": [
        "41mm"
      ],
      "price": 499.99
    }
  ]